<a href="https://colab.research.google.com/github/yo-yy/collab/blob/main/lb_2_ipynb%22.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Задание**:
Создать фрейм данных из N записей со следующими полями: Nrow – номер записи, Name – имя сотрудника, BirthYear – год рождения, EmployYear – год приема на работу, Salary – зарплата. Заполнить данный фрейм данными так, что Nrow изменяется от 1 до N. Name задается произвольно, BirthYear распределено равномерно (случайно) на отрезке [1965, 1990], EmployYear распределен равномерно на отрезке [BirthYear+18, 2006], Salary задается произвольно в интервале от 10000 до 30000. Подсчитать число сотрудников с зарплатой, больше 15000.
Добавить в таблицу поле, соответствующее суммарному подоходному налогу (ставка 13%), выплаченному сотрудником за время работы в организации.

In [ ]:
# исходное число записей и последовательность для нумерации
N <- 100
Nrow <- 1:N

In [ ]:
# формирование вектора случайно сгенерированных имен
gen_name <- function(x) {
  # lists of names examples
  name_list <- c("John", "Sue", "Bob", "Charley")
  surname_list<- c("Wilson", "Burton", "Robinson", "Jackson")

  names_len <- length(name_list)

  emp_name <- paste(
    name_list[sample(1:names_len, 1)],
    surname_list[sample(1:names_len, 1)]
  )
  emp_name
}

Name <- sapply(Nrow, gen_name)

In [ ]:
# остальные вектора
gen_empl_year <- function(birthday) {
  sample((birthday + 18):2006, 1)
}

BirthYear <- sample(1965:1990, N, replace=T)

EmployYear <- sapply(BirthYear, gen_empl_year)

Salary <- sample(10000:30000, N, replace=T)

In [ ]:
# собираем датафрейм и выводим его
df <- data.frame(
  Nrow=Nrow,
  Name=Name,
  BirthYear=BirthYear,
  EmployYear=EmployYear,
  Salary=Salary
)

head(df)

  Nrow Name           BirthYear EmployYear Salary
1 1    Bob Burton     1967      2005       26810
2 2    Charley Wilson 1978      2002       16328
3 3    Sue Jackson    1965      1985       13713
4 4    Bob Robinson   1969      1993       15553
5 5    Sue Burton     1969      2006       12690
6 6    John Jackson   1982      2000       22312

In [ ]:
salary_cmp_count <- nrow(df[df$Salary > 15000,])
cat(sprintf("Число сотрудников с зарплатой, больше 15000: %i", salary_cmp_count))

Число сотрудников с зарплатой, больше 15000: 79

In [ ]:
# расчет суммарного подоходного налога за все время работы в организации
currrent_year <- as.numeric(format(Sys.Date(), format="%Y"))
df$TotalIncomeTax <- with(df, (currrent_year - EmployYear)*Salary*0.13)

# финальный результат
head(df)

  Nrow Name           BirthYear EmployYear Salary TotalIncomeTax
1 1    Bob Burton     1967      2005       26810  59250.10
2 2    Charley Wilson 1978      2002       16328  42452.80
3 3    Sue Jackson    1965      1985       13713  65959.53
4 4    Bob Robinson   1969      1993       15553  58634.81
5 5    Sue Burton     1969      2006       12690  26395.20
6 6    John Jackson   1982      2000       22312  63812.32